# Tips and Trick Python Pandas 13 !

# Menggabungkan Dua Pandas Data  Frame

# Import Module

In [1]:
import pandas as pd
import numpy as np

print(pd.__version__)
print(np.__version__)

1.2.4
1.20.1

# Buat Data Frame

In [2]:
n_rows = 5
n_cols = 5
cols = tuple('ABCDE')

df = pd.DataFrame(np.random.randint(1, 20, size=(n_rows, n_cols)),columns=cols)

df.head()

    A   B   C   D   E
0  16  10   2   5   5
1   9  19  17   5  13
2  19  14  12  12   3
3  18   8  13  18  13
4   7   9  16   5  12

# Pecah Data Frame jadi Dua

Data Frame 1

In [7]:
df1 = df.copy(deep=True)
df1 = df1.drop([1,4])
df1

    A   B   C   D   E
0  16  10   2   5   5
2  19  14  12  12   3
3  18   8  13  18  13

Data Frame 2

In [8]:
df2 = df.copy(deep = True)
df2 = df2.drop([0, 3])
df2

    A   B   C   D   E
1   9  19  17   5  13
2  19  14  12  12   3
4   7   9  16   5  12

# Menggabungkan Dua Data Frame

Memanfaatkan method `merge`, contoh nya ada `inner` dan `outer`

- Pendekatan `Onner` merge -> Mengadopsi baris yang terdapat pada kedua data Frame

In [14]:
df_inner = pd.merge(df1, df2, how='inner')
df_inner

    A   B   C   D  E
0  19  14  12  12  3

- Pendekatan `Outer` merge -> Menggabungkan Dua Data Frame, nilai duplikasi akan dijadikan satu

In [16]:
df_outer = pd.merge(df1, df2, how='outer')
df_outer

    A   B   C   D   E
0  16  10   2   5   5
1  19  14  12  12   3
2  18   8  13  18  13
3   9  19  17   5  13
4   7   9  16   5  12